&НаКлиенте
Процедура ЗапретОприходованияПриИзменении(Элемент)
  Элементы.ДатаЗапретаОприходования.ТолькоПросмотр = НЕ Объект.ЗапретОприходования;
  Если Объект.ДатаЗапретаОприходования = Истина Тогда
    Объект.ДатаЗапретаОприходования = ТекущаяДата();
  Иначе 
    Объект.ДатаЗапретаОприходования = Неопределено;
  КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
  Элементы.ДатаЗапретаОприходования.ТолькоПросмотр = Объект.ЗапретОприходования;
КонецПроцедуры