
&НаКлиенте
Процедура ПереченьНоменклатурыКоличествоПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.ПереченьНоменклатуры.ТекущиеДанные; 
	РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти); 
КонецПроцедуры

&НаКлиенте
Процедура ПереченьНоменклатурыЦенаПриИзменении(Элемент)
	 СтрокаТабличнойЧасти = Элементы.ПереченьНоменклатуры.ТекущиеДанные; 
	 РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти); 
КонецПроцедуры

&НаКлиенте
Процедура КомментарийОткрытие(Элемент, СтандартнаяОбработка)  
  СтандартнаяОбработка = Ложь;
  Оповещение = Новый ОписаниеОповещения("подкл_ОповещениеИзмененияКомментария", ЭтаФорма);
  ОткрытьФорму("Документ.ОказаниеУслуги.Форма.ФормаВводаКомментария",, ЭтаФорма,,,,Оповещение);
  
  a = 1;   
КонецПроцедуры

  &НаКлиенте
Процедура подкл_ОповещениеИзмененияКомментария(Результат, ДополнительныеПараметры) Экспорт  
  
  Если НЕ Результат = Неопределено Тогда 
  Объект.Комментарий = Результат; 
  КонецЕсли;
КонецПроцедуры