
&НаСервере
Процедура ЗаполнитьНаСервере()
	Выборка = Документы.ОказаниеУслуги.Выбрать();
	Пока Выборка.Следующий() Цикл
	НоваяСтрока = Хранилище.Добавить();
	НоваяСтрока.Документ = Выборка.Ссылка;
		
	КонецЦикла
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ХранилищеПриАктивизацииСтрокиНаСервере(Ссылка, Склад, Клиент, Мастер)
	Склад = Ссылка.Склад;
		Клиент = Ссылка.Клиент;
	Мастер = Ссылка.Мастер;

КонецПроцедуры

&НаКлиенте
Процедура ХранилищеПриАктивизацииСтроки(Элемент)
	ХранилищеПриАктивизацииСтрокиНаСервере(Элементы.Хранилище.ТекущиеДанные.Документ,Склад, Клиент, Мастер);
КонецПроцедуры
