&НаКлиенте 
Процедура МатериалыКоличествоПриИзменении (Элемент)
СтрокаТабличнойЧасти = Элементы.Материалы.ТекущиеДанные; 
СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена; 
КонецПроцедуры

&НаКлиенте
Процедура МатериалыЦенаПриИзменении(Элемент)
СтрокаТабличнойЧасти = Элементы.Материалы.ТекущиеДанные; 
РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти); 	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
  Если ТекущийОбъект.Склад.ЗапретОприходования = Истина 
    И ТекущийОбъект.Склад.ДатаЗапретаОприходования <= ТекущийОбъект.Дата Тогда
    Отказ = Истина;
    Сообщение = Новый СообщениеПользователю;
    Сообщение.Текст = "Приходные накладные запрещено создавать для этого склада!";
    Сообщение.Сообщить();
  КонецЕсли;
  
  Для каждого Строка Из ТекущийОбъект.Материалы Цикл
	  Если Строка.Материал.ЗапретОприходования = Истина
	  И Строка.Материал.ДатаЗапретаОприходования <= ТекущийОбъект.Дата Тогда
      Отказ = Истина;
      Сообщение = Новый СообщениеПользователю;
	  Сообщение.Текст = "Ошибка! " "Номенклатуру ~" + Строка.Материал + "~ нельзя оприходовать!";
      Сообщение.Сообщить();
    КонецЕсли;
    КонецЦикла;
  КонецПроцедуры
