&НаКлиенте 
Процедура МатериалыКоличествоПриИзменении (Элемент)
СтрокаТабличнойЧасти = Элементы.Материалы.ТекущиеДанные; 
СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена; 
КонецПроцедуры

&НаКлиенте
Процедура МатериалыЦенаПриИзменении(Элемент)
СтрокаТабличнойЧасти = Элементы.Материалы.ТекущиеДанные; 
РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти); 	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
  Если ТекущийОбъект.Склад.ЗапретОприходования = Истина Тогда
    Отказ = Истина; 
    Сообщение = Новый СообщениеПользователю;
    Сообщение.Текст = "Для данного склада создание приходных накладных запрещено!";
    Сообщение.Сообщить();  
  КонецЕсли;
  Если ТекущийОбъект.Склад.ДатаЗапретаОприходования <= Объект.Дата Тогда 
    Отказ = ТекущийОбъект.Склад.ДатаЗапретаОприходования <= Объект.Дата;
    Сообщение = Новый СообщениеПользователю;
    Сообщение.Текст = "Невозможно создание приходной накладной в указанную дату!";
    Сообщение.Сообщить();  
  КонецЕсли; 
  Если ТекущийОбъект.Склад.ЗапретОприходования = Истина и ТекущийОбъект.Склад.ДатаЗапретаОприходования = 0 Тогда
    Отказ = Истина;
    Отказ = 0;
    Сообщение = Новый СообщениеПользователю;
    Сообщение.Текст = "Не заполнено поле (Дата запрета оприходования)";
    Сообщение.Сообщить();
  КонецЕсли;
КонецПроцедуры

